#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//初识转义字符
//转变字符原有意义的组合，\n是换行，\t，\?......
// 很多编译器也不支持三字母词了，少用
//vs2019不支持三字母词，三个字符组合，与转义字符相类似
//？？）会被解译为一个方块]


//活用转义字符大法————“转义你的转义”

int main()
{
	printf("1:c:\test\test.c\n");
	printf("c:\\test\\test.c\n");//转义了\t中的\，达到打印出\t的效果，\\就是防止转义的转义字符，表示一个反斜杠
	printf("2:ab\ncd\n");
	printf("3:(are u ok??)\n");//vs2022不支持三字母词
	printf("4:(are u ok\?\?)\n");//避免三字母词的用法
	printf("5:%c\n", '\'');//不转义就会和前一个单引号一起识别为一对引号出错
	printf("6:%s\n", "abcd");//注意打印字符用单引号，打印字符串用双引号
	printf("7:%s\n", "\"");
	printf("8:%s\n", "\"");//打印字符和字符串都可以用双引号
	printf("9:%d\n", sizeof(long));//注意字符和字符串的输出转义字符不同
	printf("?\n");//"?不是转义字符，不需要防止转义，这种类型验证一下就行

	printf("10:%c", '\130');/结果为X，表示
	return 0;

}